telink-semi/unisdk/soc/TLSR952X/registers/tlk_codec_0581_reg.h
/********************************************************************************************************
 * @file    tlk_codec_0581_reg.h
 *
 * @brief   This is the header file for B92
 *
 * @author  Driver Group
 * @date    2023
 *
 * @par     Copyright (c) 2019, Telink Semiconductor (Shanghai) Co., Ltd. ("TELINK")
 *
 *          Licensed under the Apache License, Version 2.0 (the "License");
 *          you may not use this file except in compliance with the License.
 *          You may obtain a copy of the License at
 *
 *              http://www.apache.org/licenses/LICENSE-2.0
 *
 *          Unless required by applicable law or agreed to in writing, software
 *          distributed under the License is distributed on an "AS IS" BASIS,
 *          WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *          See the License for the specific language governing permissions and
 *          limitations under the License.
 *
 *******************************************************************************************************/
#ifndef _CODEC_0581_REG_H_
    #define _CODEC_0581_REG_H_


    #define CODEC_EQ_PROGRAM_MEM_BASE   (0xA000) /* start address of eq program memory */
    #define CODEC_EQ_PARAM_MEM_BASE     (0xA200) /* start address of eq param   memory */
    #define CODEC_EQ_PARAM0_MEM_BASE    (0xA200) /* start address of eq param0  memory */
    #define CODEC_EQ_PARAM1_MEM_BASE    (0xA400) /* start address of eq param1  memory */
    #define CODEC_8BIT_REG_ADDR_START   (0xC000) /* start address of 8-bit reg space   */
    #define CODEC_8BIT_REG_ADDR_END     (0xCFFF) /* end   address of 8-bit reg space   */
    #define CODEC_FDSP_PROGRAM_MEM_BASE (0xD000) /* start address of fdsp code  memory */
    #define CODEC_FDSP_PARAM_MEM_BASE   (0xD100) /* start address of fdsp param memory */
    #define CODEC_FDSP_PARAM_SPAN       (0x0100) /* fdsp param len span */
    #define CODEC_FDSP_PARAM_BANKA_BASE (0xD100) /* start address of fdsp param bank a */
    #define CODEC_FDSP_PARAM_BANKB_BASE (0xD600) /* start address of fdsp param bank b */
    #define CODEC_FDSP_PARAM_BANKC_BASE (0xDB00) /* start address of fdsp param bank c */
    #define CODEC_FDSP_STATE_MEM_BASE   (0xE000) /* start address of fdsp state memory */

/**
 * REG_XXX_ADDR: means codec_0581 register address
 * BF_XXX_INFO:  first  means codec_0581 register address
 *               second means bit field information, byte0 - start bit, byte1 - bits length
 * 
 * for example: #define REG_ADC_DAC_HP_PWR_ADDR 0x0000C004 (register address)
 *              #define BF_ADC2_EN_INFO         0x0000C004 (register address),0x00000102 (byte0-0x02:start bit2, byte1-0x01:bit length 1bit)
 *                                                                               BIT[2] : ADC Channel 2 Enable: 0-Powered Off,1-Powered On
 */

    #define REG_VENDOR_ID_ADDR                  0x0000C000
    #define BF_VENDOR_INFO                      0x0000C000, 0x00000800

    #define REG_DEVICE_ID1_ADDR                 0x0000C001
    #define BF_DEVICE1_INFO                     0x0000C001, 0x00000800

    #define REG_DEVICE_ID2_ADDR                 0x0000C002
    #define BF_DEVICE2_INFO                     0x0000C002, 0x00000800

    #define REG_REVISION_ADDR                   0x0000C003
    #define BF_REV_INFO                         0x0000C003, 0x00000800

    #define REG_ADC_DAC_HP_PWR_ADDR             0x0000C004
    #define BF_ADC0_EN_INFO                     0x0000C004, 0x00000100
    #define BF_ADC1_EN_INFO                     0x0000C004, 0x00000101
    #define BF_ADC2_EN_INFO                     0x0000C004, 0x00000102
    #define BF_PB0_EN_INFO                      0x0000C004, 0x00000104

    #define REG_PLL_PGA_PWR_ADDR                0x0000C005
    #define BF_PLL_EN_INFO                      0x0000C005, 0x00000100
    #define BF_RCOSC_PD_INFO                    0x0000C005, 0x00000101
    #define BF_RCOSC_EN_INFO                    0x0000C005, 0x00000102
    #define BF_PGA0_EN_INFO                     0x0000C005, 0x00000104
    #define BF_PGA1_EN_INFO                     0x0000C005, 0x00000105
    #define BF_PGA2_EN_INFO                     0x0000C005, 0x00000106
    #define BF_MCLKIN_EN_INFO                   0x0000C005, 0x00000107

    #define REG_SAI_CLK_PWR_ADDR                0x0000C006
    #define BF_SPT0_IN_EN_INFO                  0x0000C006, 0x00000100
    #define BF_SPT0_OUT_EN_INFO                 0x0000C006, 0x00000101

    #define REG_DSP_PWR_ADDR                    0x0000C007
    #define BF_FDSP_EN_INFO                     0x0000C007, 0x00000100

    #define REG_ASRC_PWR_ADDR                   0x0000C008
    #define BF_ASRCI0_EN_INFO                   0x0000C008, 0x00000100
    #define BF_ASRCO0_EN_INFO                   0x0000C008, 0x00000104
    #define BF_ASRCO1_EN_INFO                   0x0000C008, 0x00000105
    #define BF_ASRCO2_EN_INFO                   0x0000C008, 0x00000106

    #define REG_FINT_PWR_ADDR                   0x0000C009
    #define BF_FINT0_EN_INFO                    0x0000C009, 0x00000100
    #define BF_FINT1_EN_INFO                    0x0000C009, 0x00000101

    #define REG_FDEC_PWR_ADDR                   0x0000C00A
    #define BF_FDEC0_EN_INFO                    0x0000C00A, 0x00000100
    #define BF_FDEC1_EN_INFO                    0x0000C00A, 0x00000101
    #define BF_FDEC2_EN_INFO                    0x0000C00A, 0x00000102
    #define BF_FDEC3_EN_INFO                    0x0000C00A, 0x00000103

    #define REG_KEEPS_ADDR                      0x0000C00B
    #define BF_KEEP_MEM_INFO                    0x0000C00B, 0x00000100

    #define REG_CHIP_PWR_ADDR                   0x0000C00C
    #define BF_POWER_EN_INFO                    0x0000C00C, 0x00000100
    #define BF_MASTER_BLOCK_EN_INFO             0x0000C00C, 0x00000101
    #define BF_CM_STARTUP_OVER_INFO             0x0000C00C, 0x00000102
    #define BF_DLDO_CTRL_INFO                   0x0000C00C, 0x00000304

    #define REG_CLK_CTRL1_ADDR                  0x0000C00E
    #define BF_PLL_SOURCE_INFO                  0x0000C00E, 0x00000300
    #define BF_PLL_TYPE_INFO                    0x0000C00E, 0x00000104
    #define BF_PLL_FM_BYPASS_INFO               0x0000C00E, 0x00000105
    #define BF_SYNC_SOURCE_INFO                 0x0000C00E, 0x00000206

    #define REG_CLK_CTRL2_ADDR                  0x0000C00F
    #define BF_PLL_INPUT_PRESCALER_INFO         0x0000C00F, 0x00000300

    #define REG_CLK_CTRL3_ADDR                  0x0000C010
    #define BF_PLL_INTEGER_DIVIDER_INFO         0x0000C010, 0x00000D00

    #define REG_CLK_CTRL4_ADDR                  0x0000C011

    #define REG_CLK_CTRL5_ADDR                  0x0000C012
    #define BF_PLL_NUMERATOR_INFO               0x0000C012, 0x00001000

    #define REG_CLK_CTRL6_ADDR                  0x0000C013

