telink-semi/unisdk/soc/TLSR952X/registers/tlk_codec_0581_reg.h
    #define REG_CLK_CTRL7_ADDR                  0x0000C014
    #define BF_PLL_DENOMINATOR_INFO             0x0000C014, 0x00001000

    #define REG_CLK_CTRL8_ADDR                  0x0000C015

    #define REG_CLK_CTRL9_ADDR                  0x0000C016
    #define BF_PLL_UPDATE_INFO                  0x0000C016, 0x00000100

    #define REG_CLK_CTRL10_ADDR                 0x0000C017
    #define BF_ADC_FREQ_INFO                    0x0000C017, 0x00000100

    #define REG_CLK_CTRL11_ADDR                 0x0000C018
    #define BF_FREQ_MULT_EN_INFO                0x0000C018, 0x00000100

    #define REG_ADC_CTRL1_ADDR                  0x0000C020
    #define BF_ADC01_FS_INFO                    0x0000C020, 0x00000300
    #define BF_ADC01_DEC_ORDER_INFO             0x0000C020, 0x00000103
    #define BF_ADC2_FS_INFO                     0x0000C020, 0x00000304
    #define BF_ADC2_DEC_ORDER_INFO              0x0000C020, 0x00000107

    #define REG_ADC_CTRL2_ADDR                  0x0000C021
    #define BF_ADC0_IBIAS_INFO                  0x0000C021, 0x00000300
    #define BF_ADC1_IBIAS_INFO                  0x0000C021, 0x00000304

    #define REG_ADC_CTRL3_ADDR                  0x0000C022
    #define BF_ADC2_IBIAS_INFO                  0x0000C022, 0x00000300

    #define REG_ADC_CTRL4_ADDR                  0x0000C023
    #define BF_ADC0_HPF_EN_INFO                 0x0000C023, 0x00000200
    #define BF_ADC1_HPF_EN_INFO                 0x0000C023, 0x00000202
    #define BF_ADC2_HPF_EN_INFO                 0x0000C023, 0x00000204

    #define REG_ADC_CTRL5_ADDR                  0x0000C024
    #define BF_ADC01_FCOMP_INFO                 0x0000C024, 0x00000100
    #define BF_ADC2_FCOMP_INFO                  0x0000C024, 0x00000101
    #define BF_ADC_HARD_VOL_INFO                0x0000C024, 0x00000104
    #define BF_ADC_VOL_LINK_INFO                0x0000C024, 0x00000105
    #define BF_ADC_VOL_ZC_INFO                  0x0000C024, 0x00000106

    #define REG_ADC_CTRL6_ADDR                  0x0000C025
    #define BF_ADC_AIN_CHRG_TIME_INFO           0x0000C025, 0x00000400
    #define BF_ADC_CHOP_EN_INFO                 0x0000C025, 0x00000105

    #define REG_ADC_CTRL7_ADDR                  0x0000C026
    #define BF_ADC_VOC_WKUP_INFO                0x0000C026, 0x00000100
    #define BF_AIN0_INPUT_MODE_INFO             0x0000C026, 0x00000104
    #define BF_AIN1_INPUT_MODE_INFO             0x0000C026, 0x00000105

    #define REG_ADC_MUTES_ADDR                  0x0000C027
    #define BF_ADC0_MUTE_INFO                   0x0000C027, 0x00000100
    #define BF_ADC1_MUTE_INFO                   0x0000C027, 0x00000101
    #define BF_ADC2_MUTE_INFO                   0x0000C027, 0x00000102

    #define REG_ADC0_VOL_ADDR                   0x0000C028
    #define BF_ADC0_VOL_INFO                    0x0000C028, 0x00000800

    #define REG_ADC1_VOL_ADDR                   0x0000C029
    #define BF_ADC1_VOL_INFO                    0x0000C029, 0x00000800

    #define REG_ADC2_VOL_ADDR                   0x0000C02A
    #define BF_ADC2_VOL_INFO                    0x0000C02A, 0x00000800

    #define REG_ADC_DITHER_LEV_ADDR             0x0000C02B
    #define BF_ADC_DITHER_LEV_INFO              0x0000C02B, 0x00000300

    #define REG_PGA0_CTRL1_ADDR                 0x0000C030
    #define BF_PGA0_GAIN_INFO                   0x0000C030, 0x00000B00
    #define BF_PGA0_SLEW_DIS_INFO               0x0000C030, 0x00000107

    #define REG_PGA0_CTRL2_ADDR                 0x0000C031

    #define REG_PGA1_CTRL1_ADDR                 0x0000C032
    #define BF_PGA1_GAIN_INFO                   0x0000C032, 0x00000B00
    #define BF_PGA1_SLEW_DIS_INFO               0x0000C032, 0x00000107

    #define REG_PGA1_CTRL2_ADDR                 0x0000C033

    #define REG_PGA2_CTRL1_ADDR                 0x0000C034
    #define BF_PGA2_GAIN_INFO                   0x0000C034, 0x00000B00
    #define BF_PGA2_SLEW_DIS_INFO               0x0000C034, 0x00000107

    #define REG_PGA2_CTRL2_ADDR                 0x0000C035

    #define REG_PGA_CTRL1_ADDR                  0x0000C036
    #define BF_PGA_SLEW_RATE_INFO               0x0000C036, 0x00000200
    #define BF_PGA_GAIN_LINK_INFO               0x0000C036, 0x00000104

    #define REG_PGA_CTRL2_ADDR                  0x0000C039
    #define BF_PGA0_RIN_INFO                    0x0000C039, 0x00000100
    #define BF_PGA1_RIN_INFO                    0x0000C039, 0x00000101
    #define BF_PGA2_RIN_INFO                    0x0000C039, 0x00000102
    #define BF_PGA0_POWER_MODE_INFO             0x0000C039, 0x00000104
    #define BF_PGA1_POWER_MODE_INFO             0x0000C039, 0x00000105
    #define BF_PGA2_POWER_MODE_INFO             0x0000C039, 0x00000106

    #define REG_MBIAS_CTRL_ADDR                 0x0000C030
    #define BF_MBIAS0_LEVEL_INFO                0x0000C030, 0x00000100
    #define BF_MBIAS1_LEVEL_INFO                0x0000C030, 0x00000101
    #define BF_MBIAS_IBIAS_INFO                 0x0000C030, 0x00000204

    #define REG_DMIC_CTRL1_ADDR                 0x0000C040
    #define BF_DMIC_CLK0_RATE_INFO              0x0000C040, 0x00000300
    #define BF_DMIC_CLK1_RATE_INFO              0x0000C040, 0x00000304

    #define REG_DMIC_CTRL2_ADDR                 0x0000C041
    #define BF_DMIC01_FS_INFO                   0x0000C041, 0x00000300
    #define BF_DMIC01_HPF_EN_INFO               0x0000C041, 0x00000103
    #define BF_DMIC01_DEC_ORDER_INFO            0x0000C041, 0x00000104
    #define BF_DMIC01_FCOMP_INFO                0x0000C041, 0x00000105
    #define BF_DMIC01_EDGE_INFO                 0x0000C041, 0x00000106
    #define BF_DMIC01_MAP_INFO                  0x0000C041, 0x00000107

    #define REG_DMIC_CTRL3_ADDR                 0x0000C042
    #define BF_DMIC23_FS_INFO                   0x0000C042, 0x00000300
    #define BF_DMIC23_HPF_EN_INFO               0x0000C042, 0x00000103
    #define BF_DMIC23_DEC_ORDER_INFO            0x0000C042, 0x00000104
    #define BF_DMIC23_FCOMP_INFO                0x0000C042, 0x00000105
    #define BF_DMIC23_EDGE_INFO                 0x0000C042, 0x00000106
    #define BF_DMIC23_MAP_INFO                  0x0000C042, 0x00000107

    #define REG_DMIC_CTRL4_ADDR                 0x0000C043
    #define BF_DMIC45_FS_INFO                   0x0000C043, 0x00000300
    #define BF_DMIC45_HPF_EN_INFO               0x0000C043, 0x00000103
    #define BF_DMIC45_DEC_ORDER_INFO            0x0000C043, 0x00000104
    #define BF_DMIC45_FCOMP_INFO                0x0000C043, 0x00000105
    #define BF_DMIC45_EDGE_INFO                 0x0000C043, 0x00000106
    #define BF_DMIC45_MAP_INFO                  0x0000C043, 0x00000107

    #define REG_DMIC_CTRL5_ADDR                 0x0000C044
    #define BF_DMIC67_FS_INFO                   0x0000C044, 0x00000300
    #define BF_DMIC67_HPF_EN_INFO               0x0000C044, 0x00000103
    #define BF_DMIC67_DEC_ORDER_INFO            0x0000C044, 0x00000104
    #define BF_DMIC67_FCOMP_INFO                0x0000C044, 0x00000105
    #define BF_DMIC67_EDGE_INFO                 0x0000C044, 0x00000106
    #define BF_DMIC67_MAP_INFO                  0x0000C044, 0x00000107

