telink-semi/unisdk/soc/TLSR952X/registers/tlk_codec_0581_reg.h
    #define REG_ASRCO_ROUTE1_ADDR               0x0000C095
    #define BF_ASRCO1_ROUTE_INFO                0x0000C095, 0x00000600

    #define REG_ASRCO_ROUTE2_ADDR               0x0000C096
    #define BF_ASRCO2_ROUTE_INFO                0x0000C096, 0x00000600

    #define REG_FDSP_RUN_ADDR                   0x0000C0A0
    #define BF_FDSP_RUN_INFO                    0x0000C0A0, 0x00000100

    #define REG_FDSP_CTRL1_ADDR                 0x0000C0A1
    #define BF_FDSP_BANK_SEL_INFO               0x0000C0A1, 0x00000200
    #define BF_FDSP_RAMP_MODE_INFO              0x0000C0A1, 0x00000102
    #define BF_FDSP_ZERO_STATE_INFO             0x0000C0A1, 0x00000103
    #define BF_FDSP_RAMP_RATE_INFO              0x0000C0A1, 0x00000404

    #define REG_FDSP_CTRL2_ADDR                 0x0000C0A2
    #define BF_FDSP_LAMBDA_INFO                 0x0000C0A2, 0x00000600

    #define REG_FDSP_CTRL3_ADDR                 0x0000C0A3
    #define BF_FDSP_COPY_AB_INFO                0x0000C0A3, 0x00000100
    #define BF_FDSP_COPY_AC_INFO                0x0000C0A3, 0x00000101
    #define BF_FDSP_COPY_BA_INFO                0x0000C0A3, 0x00000102
    #define BF_FDSP_COPY_BC_INFO                0x0000C0A3, 0x00000103
    #define BF_FDSP_COPY_CA_INFO                0x0000C0A3, 0x00000104
    #define BF_FDSP_COPY_CB_INFO                0x0000C0A3, 0x00000105
    #define BF_FDSP_COPY_DONE_CLEAR_INFO        0x0000C0A3, 0x00000107

    #define REG_FDSP_CTRL4_ADDR                 0x0000C0A4
    #define BF_FDSP_RATE_SOURCE_INFO            0x0000C0A4, 0x00000400
    #define BF_FDSP_EXP_ATK_SPEED_INFO          0x0000C0A4, 0x00000104
    #define BF_FDSP_ONZ_SOURCE_INFO             0x0000C0A4, 0x00000105

    #define REG_FDSP_CTRL5_ADDR                 0x0000C0A5
    #define BF_FDSP_RATE_DIV_INFO               0x0000C0A5, 0x00001000

    #define REG_FDSP_CTRL6_ADDR                 0x0000C0A6

    #define REG_FDSP_CTRL7_ADDR                 0x0000C0A7
    #define BF_FDSP_MOD_N_INFO                  0x0000C0A7, 0x00000600

    #define REG_FDSP_CTRL8_ADDR                 0x0000C0A8
    #define BF_FDSP_REG_COND0_INFO              0x0000C0A8, 0x00000100
    #define BF_FDSP_REG_COND1_INFO              0x0000C0A8, 0x00000101
    #define BF_FDSP_REG_COND2_INFO              0x0000C0A8, 0x00000102
    #define BF_FDSP_REG_COND3_INFO              0x0000C0A8, 0x00000103
    #define BF_FDSP_REG_COND4_INFO              0x0000C0A8, 0x00000104
    #define BF_FDSP_REG_COND5_INFO              0x0000C0A8, 0x00000105
    #define BF_FDSP_REG_COND6_INFO              0x0000C0A8, 0x00000106
    #define BF_FDSP_REG_COND7_INFO              0x0000C0A8, 0x00000107

    #define REG_FDSP_SL_ADDR_ADDR               0x0000C0A9
    #define BF_FDSP_SL_ADDR_INFO                0x0000C0A9, 0x00000600

    #define REG_FDSP_SL_P0_0_ADDR               0x0000C0AA
    #define BF_FDSP_SL_P0_INFO                  0x0000C0AA, 0x00002000

    #define REG_FDSP_SL_P0_1_ADDR               0x0000C0AB

    #define REG_FDSP_SL_P0_2_ADDR               0x0000C0AC

    #define REG_FDSP_SL_P0_3_ADDR               0x0000C0AD

    #define REG_FDSP_SL_P1_0_ADDR               0x0000C0AE
    #define BF_FDSP_SL_P1_INFO                  0x0000C0AE, 0x00002000

    #define REG_FDSP_SL_P1_1_ADDR               0x0000C0AF

    #define REG_FDSP_SL_P1_2_ADDR               0x0000C0B0

    #define REG_FDSP_SL_P1_3_ADDR               0x0000C0B1

    #define REG_FDSP_SL_P2_0_ADDR               0x0000C0B2
    #define BF_FDSP_SL_P2_INFO                  0x0000C0B2, 0x00002000

    #define REG_FDSP_SL_P2_1_ADDR               0x0000C0B3

    #define REG_FDSP_SL_P2_2_ADDR               0x0000C0B4

    #define REG_FDSP_SL_P2_3_ADDR               0x0000C0B5

    #define REG_FDSP_SL_P3_0_ADDR               0x0000C0B6
    #define BF_FDSP_SL_P3_INFO                  0x0000C0B6, 0x00002000

    #define REG_FDSP_SL_P3_1_ADDR               0x0000C0B7

    #define REG_FDSP_SL_P3_2_ADDR               0x0000C0B8

    #define REG_FDSP_SL_P3_3_ADDR               0x0000C0B9

    #define REG_FDSP_SL_P4_0_ADDR               0x0000C0BA
    #define BF_FDSP_SL_P4_INFO                  0x0000C0BA, 0x00002000

    #define REG_FDSP_SL_P4_1_ADDR               0x0000C0BB

    #define REG_FDSP_SL_P4_2_ADDR               0x0000C0BC

    #define REG_FDSP_SL_P4_3_ADDR               0x0000C0BD

    #define REG_FDSP_SL_UPDATE_ADDR             0x0000C0BE
    #define BF_FDSP_SL_UPDATE_INFO              0x0000C0BE, 0x00000100

    #define REG_FDSP_ONZ_MASK0_ADDR             0x0000C0BF
    #define BF_FDSP_ONZ_MASK_INFO               0x0000C0BF, 0x00001800

    #define REG_FDSP_ONZ_MASK1_ADDR             0x0000C0C0

    #define REG_FDSP_ONZ_MASK2_ADDR             0x0000C0C1

    #define REG_RCOSC_ACTION_ADDR               0x0000C0C2
    #define BF_RCOSC_STARTCAL_INFO              0x0000C0C2, 0x00000100
    #define BF_RCOSC_FXCAL_INFO                 0x0000C0C2, 0x00000101
    #define BF_RCOSC_STATUS_INFO                0x0000C0C2, 0x00000204

    #define REG_RCOSC_CALCFG0_ADDR              0x0000C0C3
    #define BF_RCOSC_REFSEL_INFO                0x0000C0C3, 0x00000400
    #define BF_RCOSC_ERR_TH_INFO                0x0000C0C3, 0x00000404

    #define REG_RCOSC_CALCFG1_ADDR              0x0000C0C4
    #define BF_RCOSC_TASK_TH_INFO               0x0000C0C4, 0x00000400
    #define BF_RCOSC_JOB_TH_INFO                0x0000C0C4, 0x00000404

    #define REG_RCOSC_FERR0_ADDR                0x0000C0C5
    #define BF_RCOSC_FERR_INFO                  0x0000C0C5, 0x00000E00

    #define REG_RCOSC_FERR1_ADDR                0x0000C0C6

    #define REG_RCOSC_FRQTRIM_ADDR              0x0000C0C7
    #define BF_RCOSC_FRQTRIM_INFO               0x0000C0C7, 0x00000700

    #define REG_RCOSC_FXTRIM_ADDR               0x0000C0C8
    #define BF_RCOSC_FXTRIM_INFO                0x0000C0C8, 0x00000700
    #define BF_RCOSC_DISTRIM_INFO               0x0000C0C8, 0x00000107

    #define REG_RCOSC_TCTRIM_ADDR               0x0000C0C9
    #define BF_RCOSC_TCTRIM_INFO                0x0000C0C9, 0x00000700

    #define REG_MCLKOUT_IRQ_CTRL_ADDR           0x0000C0D2
    #define BF_IRQ_OUT_INFO                     0x0000C0D2, 0x00000400
    #define BF_CLOCKOUT_AND_IRQ_OUT_INFO        0x0000C0D2, 0x00000404

    #define REG_MP_CTRL7_ADDR                   0x0000C0D6
    #define BF_GPI_DB_INFO                      0x0000C0D6, 0x00000300
    #define BF_MCLKO_RATE_INFO                  0x0000C0D6, 0x00000304

    #define REG_MP_CTRL9_ADDR                   0x0000C0D8

    #define REG_MP_CTRL10_ADDR                  0x0000C0D9
    #define BF_MP12_MODE_INFO                   0x0000C0D9, 0x00000400

    #define REG_SELFBOOT_CTRL_ADDR              0x0000C0DA
    #define BF_SELFBOOT_DRIVE_INFO              0x0000C0DA, 0x00000200
    #define BF_SELFBOOT_PULL_EN_INFO            0x0000C0DA, 0x00000104
    #define BF_SELFBOOT_PULL_SEL_INFO           0x0000C0DA, 0x00000105
    #define BF_SELFBOOT_SLEW_INFO               0x0000C0DA, 0x00000106

