telink-semi/unisdk/soc/TLSR952X/registers/tlk_codec_0581_reg.h
    #define REG_READ_LAMBDA_ADDR                0x0000C130
    #define BF_FDSP_CURRENT_LAMBDA_INFO         0x0000C130, 0x00000600

    #define REG_STATUS1_ADDR                    0x0000C131
    #define BF_DAC0_CLIP_INFO                   0x0000C131, 0x00000100
    #define BF_ADC0_CLIP_INFO                   0x0000C131, 0x00000104
    #define BF_ADC1_CLIP_INFO                   0x0000C131, 0x00000105
    #define BF_ADC2_CLIP_INFO                   0x0000C131, 0x00000106

    #define REG_STATUS2_ADDR                    0x0000C132
    #define BF_PLL_LOCK_INFO                    0x0000C132, 0x00000100
    #define BF_AVDD_UVW_INFO                    0x0000C132, 0x00000101
    #define BF_ASRCI_LOCK_INFO                  0x0000C132, 0x00000102
    #define BF_ASRCO_LOCK_INFO                  0x0000C132, 0x00000103
    #define BF_SPT0_LOCK_INFO                   0x0000C132, 0x00000104
    #define BF_SYNC_LOCK_INFO                   0x0000C132, 0x00000106
    #define BF_POWER_UP_COMPLETE_INFO           0x0000C132, 0x00000107

    #define REG_STATUS3_ADDR                    0x0000C133
    #define BF_FDSP_MASK_ONZ_INFO               0x0000C133, 0x00000100
    #define BF_FDSP_BANK_COPY_DONE_INFO         0x0000C133, 0x00000104

    #define REG_GPI2_ADDR                       0x0000C135

    #define REG_EQ_STATUS_ADDR                  0x0000C136
    #define BF_EQ_CLEAR_DONE_INFO               0x0000C136, 0x00000100

    #define REG_IRQ1_STATUS1_ADDR               0x0000C138
    #define BF_IRQ1_DAC0_CLIP_INFO              0x0000C138, 0x00000100
    #define BF_IRQ1_ADC0_CLIP_INFO              0x0000C138, 0x00000104
    #define BF_IRQ1_ADC1_CLIP_INFO              0x0000C138, 0x00000105
    #define BF_IRQ1_ADC2_CLIP_INFO              0x0000C138, 0x00000106

    #define REG_IRQ1_STATUS2_ADDR               0x0000C139
    #define BF_IRQ1_PLL_LOCKED_INFO             0x0000C139, 0x00000100
    #define BF_IRQ1_PLL_UNLOCKED_INFO           0x0000C139, 0x00000101
    #define BF_IRQ1_AVDD_UVW_INFO               0x0000C139, 0x00000102
    #define BF_IRQ1_PRAMP_INFO                  0x0000C139, 0x00000103
    #define BF_IRQ1_ASRCI_LOCKED_INFO           0x0000C139, 0x00000104
    #define BF_IRQ1_ASRCI_UNLOCKED_INFO         0x0000C139, 0x00000105
    #define BF_IRQ1_ASRCO_LOCKED_INFO           0x0000C139, 0x00000106
    #define BF_IRQ1_ASRCO_UNLOCKED_INFO         0x0000C139, 0x00000107

    #define REG_IRQ1_STATUS3_ADDR               0x0000C13A
    #define BF_IRQ1_SYNC_LOCKED_INFO            0x0000C13A, 0x00000100
    #define BF_IRQ1_SYNC_UNLOCKED_INFO          0x0000C13A, 0x00000101
    #define BF_IRQ1_SPT0_UNLOCKED_INFO          0x0000C13A, 0x00000102
    #define BF_IRQ1_POWER_UP_COMPLETE_INFO      0x0000C13A, 0x00000104
    #define BF_IRQ1_EQ_CLEAR_DONE_INFO          0x0000C13A, 0x00000105
    #define BF_IRQ1_FDSP_MASK_ONZ_INFO          0x0000C13A, 0x00000106

    #define REG_IRQ2_STATUS1_ADDR               0x0000C13B
    #define BF_IRQ2_DAC0_CLIP_INFO              0x0000C13B, 0x00000100
    #define BF_IRQ2_ADC0_CLIP_INFO              0x0000C13B, 0x00000104
    #define BF_IRQ2_ADC1_CLIP_INFO              0x0000C13B, 0x00000105
    #define BF_IRQ2_ADC2_CLIP_INFO              0x0000C13B, 0x00000106

    #define REG_IRQ2_STATUS2_ADDR               0x0000C13C
    #define BF_IRQ2_PLL_LOCKED_INFO             0x0000C13C, 0x00000100
    #define BF_IRQ2_PLL_UNLOCKED_INFO           0x0000C13C, 0x00000101
    #define BF_IRQ2_AVDD_UVW_INFO               0x0000C13C, 0x00000102
    #define BF_IRQ2_PRAMP_INFO                  0x0000C13C, 0x00000103
    #define BF_IRQ2_ASRCI_LOCKED_INFO           0x0000C13C, 0x00000104
    #define BF_IRQ2_ASRCI_UNLOCKED_INFO         0x0000C13C, 0x00000105
    #define BF_IRQ2_ASRCO_LOCKED_INFO           0x0000C13C, 0x00000106
    #define BF_IRQ2_ASRCO_UNLOCKED_INFO         0x0000C13C, 0x00000107

    #define REG_IRQ2_STATUS3_ADDR               0x0000C13D
    #define BF_IRQ2_SYNC_LOCKED_INFO            0x0000C13D, 0x00000100
    #define BF_IRQ2_SYNC_UNLOCKED_INFO          0x0000C13D, 0x00000101
    #define BF_IRQ2_SPT0_UNLOCKED_INFO          0x0000C13D, 0x00000102
    #define BF_IRQ2_POWER_UP_COMPLETE_INFO      0x0000C13D, 0x00000104
    #define BF_IRQ2_EQ_CLEAR_DONE_INFO          0x0000C13D, 0x00000105
    #define BF_IRQ2_FDSP_MASK_ONZ_INFO          0x0000C13D, 0x00000106

    #define REG_SPT0_CTRL1_ADDR                 0x0000C150
    #define BF_SPT0_SAI_MODE_INFO               0x0000C150, 0x00000100
    #define BF_SPT0_DATA_FORMAT_INFO            0x0000C150, 0x00000301
    #define BF_SPT0_SLOT_WIDTH_INFO             0x0000C150, 0x00000204
    #define BF_SPT0_TRI_STATE_INFO              0x0000C150, 0x00000106

    #define REG_SPT0_CTRL2_ADDR                 0x0000C151
    #define BF_SPT0_BCLK_SRC_INFO               0x0000C151, 0x00000300
    #define BF_SPT0_BCLK_POL_INFO               0x0000C151, 0x00000103

    #define REG_SPT0_CTRL3_ADDR                 0x0000C152
    #define BF_SPT0_LRCLK_SRC_INFO              0x0000C152, 0x00000400
    #define BF_SPT0_LRCLK_POL_INFO              0x0000C152, 0x00000104

    #define REG_SPT0_ROUTE0_ADDR                0x0000C153
    #define BF_SPT0_OUT_ROUTE0_INFO             0x0000C153, 0x00000600

    #define REG_SPT0_ROUTE1_ADDR                0x0000C154
    #define BF_SPT0_OUT_ROUTE1_INFO             0x0000C154, 0x00000600

    #define REG_SPT0_ROUTE2_ADDR                0x0000C155
    #define BF_SPT0_OUT_ROUTE2_INFO             0x0000C155, 0x00000600

    #define REG_SPT0_ROUTE3_ADDR                0x0000C156
    #define BF_SPT0_OUT_ROUTE3_INFO             0x0000C156, 0x00000600

    #define REG_SPT0_ROUTE4_ADDR                0x0000C157
    #define BF_SPT0_OUT_ROUTE4_INFO             0x0000C157, 0x00000600

    #define REG_SPT0_ROUTE5_ADDR                0x0000C158
    #define BF_SPT0_OUT_ROUTE5_INFO             0x0000C158, 0x00000600

    #define REG_SPT0_ROUTE6_ADDR                0x0000C159
    #define BF_SPT0_OUT_ROUTE6_INFO             0x0000C159, 0x00000600

    #define REG_SPT0_ROUTE7_ADDR                0x0000C15A
    #define BF_SPT0_OUT_ROUTE7_INFO             0x0000C15A, 0x00000600

