telink-semi/unisdk/soc/TLSR952X/registers/tlk_codec_0581_reg.h
    #define REG_SPT0_ROUTE8_ADDR                0x0000C15B
    #define BF_SPT0_OUT_ROUTE8_INFO             0x0000C15B, 0x00000600

    #define REG_SPT0_ROUTE9_ADDR                0x0000C15C
    #define BF_SPT0_OUT_ROUTE9_INFO             0x0000C15C, 0x00000600

    #define REG_SPT0_ROUTE10_ADDR               0x0000C15D
    #define BF_SPT0_OUT_ROUTE10_INFO            0x0000C15D, 0x00000600

    #define REG_SPT0_ROUTE11_ADDR               0x0000C15E
    #define BF_SPT0_OUT_ROUTE11_INFO            0x0000C15E, 0x00000600

    #define REG_SPT0_ROUTE12_ADDR               0x0000C15F
    #define BF_SPT0_OUT_ROUTE12_INFO            0x0000C15F, 0x00000600

    #define REG_SPT0_ROUTE13_ADDR               0x0000C160
    #define BF_SPT0_OUT_ROUTE13_INFO            0x0000C160, 0x00000600

    #define REG_SPT0_ROUTE14_ADDR               0x0000C161
    #define BF_SPT0_OUT_ROUTE14_INFO            0x0000C161, 0x00000600

    #define REG_SPT0_ROUTE15_ADDR               0x0000C162
    #define BF_SPT0_OUT_ROUTE15_INFO            0x0000C162, 0x00000600

    #define REG_PDM_CTRL1_ADDR                  0x0000C180
    #define BF_PDM_FS_INFO                      0x0000C180, 0x00000300
    #define BF_PDM_FCOMP_INFO                   0x0000C180, 0x00000103
    #define BF_PDM_RATE_INFO                    0x0000C180, 0x00000104
    #define BF_PDM_MORE_FILT_INFO               0x0000C180, 0x00000107

    #define REG_PDM_CTRL2_ADDR                  0x0000C181
    #define BF_PDM_VOL_LINK_INFO                0x0000C181, 0x00000100
    #define BF_PDM_HARD_VOL_INFO                0x0000C181, 0x00000101
    #define BF_PDM_VOL_ZC_INFO                  0x0000C181, 0x00000102
    #define BF_PDM0_HPF_EN_INFO                 0x0000C181, 0x00000104
    #define BF_PDM1_HPF_EN_INFO                 0x0000C181, 0x00000105
    #define BF_PDM0_MUTE_INFO                   0x0000C181, 0x00000106
    #define BF_PDM1_MUTE_INFO                   0x0000C181, 0x00000107

    #define REG_PDM_VOL0_ADDR                   0x0000C182
    #define BF_PDM0_VOL_INFO                    0x0000C182, 0x00000800

    #define REG_PDM_VOL1_ADDR                   0x0000C183
    #define BF_PDM1_VOL_INFO                    0x0000C183, 0x00000800

    #define REG_PDM_ROUTE0_ADDR                 0x0000C184
    #define BF_PDM0_ROUTE_INFO                  0x0000C184, 0x00000700

    #define REG_PDM_ROUTE1_ADDR                 0x0000C185
    #define BF_PDM1_ROUTE_INFO                  0x0000C185, 0x00000700

    #define REG_KEY_SELECT_ADDR                 0x0000C190
    #define BF_AUTH_DONE_INFO                   0x0000C190, 0x00000104
    #define BF_DECRYPT_READY_INFO               0x0000C190, 0x00000105

    #define REG_NONCE_1_ADDR                    0x0000C192

    #define REG_AUTH_CHALLENGE_2_ADDR           0x0000C194

    #define REG_AUTH_CHALLENGE_1_ADDR           0x0000C195

    #define REG_AUTH_RESPONSE_2_ADDR            0x0000C197

    #define REG_AUTH_RESPONSE_1_ADDR            0x0000C198

    #define REG_READBACK_KEY_15_ADDR            0x0000C19A

    #define REG_READBACK_KEY_14_ADDR            0x0000C19B

    #define REG_READBACK_KEY_13_ADDR            0x0000C19C

    #define REG_READBACK_KEY_12_ADDR            0x0000C19D

    #define REG_READBACK_KEY_11_ADDR            0x0000C19E

    #define REG_READBACK_KEY_10_ADDR            0x0000C19F

    #define REG_READBACK_KEY_9_ADDR             0x0000C1A0

    #define REG_READBACK_KEY_8_ADDR             0x0000C1A1

    #define REG_READBACK_KEY_7_ADDR             0x0000C1A2

    #define REG_READBACK_KEY_6_ADDR             0x0000C1A3

    #define REG_READBACK_KEY_5_ADDR             0x0000C1A4

    #define REG_READBACK_KEY_4_ADDR             0x0000C1A5

    #define REG_READBACK_KEY_3_ADDR             0x0000C1A6

    #define REG_READBACK_KEY_2_ADDR             0x0000C1A7

    #define REG_READBACK_KEY_1_ADDR             0x0000C1A8

    #define REG_DAC_NOISE_CTRL2_ADDR            0x0000CC04
    #define BF_DAC_LOW_NOISE_EN2_INFO           0x0000CC04, 0x00000101

    #define REG_DAC_NOISE_CTRL1_ADDR            0x0000CC13
    #define BF_DAC_LOW_NOISE_EN1_INFO           0x0000CC13, 0x00000104

    #define REG_XTAL_TEST_ADDR                  0x0000CC18

    #define REG_EXTRA3_ADDR                     0x0000CC36

    #define REG_PMU_CTRL2_ADDR                  0x0000CC3F


#endif /* _CODEC_0581_REG_H_ */

/************************** end of file *****************************/
